Долома/src/Documents/ИзменениеКлички/ИзменениеКлички.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеКлички</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ферма</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Животные</name>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>СтараяКличка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяКличка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Долома/src/Documents/ИзменениеКлички/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Для Каждого СтрокаТЧ Из Животные Цикл
		
		РеквизитыЖивотного = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.Животное, "Кличка, Бирка");
		
		Если РеквизитыЖивотного.Кличка = СтрокаТЧ.НоваяКличка Тогда
			Продолжить;
		КонецЕсли;
		
		ЖивотноеОбъект = СтрокаТЧ.Животное.ПолучитьОбъект();
		ЖивотноеОбъект.Кличка = СтрокаТЧ.НоваяКличка;
		Бирка = РеквизитыЖивотного.Бирка;
		ЖивотноеОбъект.Наименование = Строка(Бирка) + " " + СтрокаТЧ.НоваяКличка;
		ЖивотноеОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
